#include <bits/stdc++.h>
#include <math.h>
using namespace std;

// Даны два действительных числа a и b. Получить их сумму, разность и произведение.

int main() {
    float a,b;
    cout << "Введите два числа: ";
    cin >> a >> b;
    
    cout << "a = " << a << ", b = " << b << endl;
    cout << "a + b = " << a + b << endl;
    cout << "a - b = " << a - b << endl;
    cout << "a * b = " << a * b;
    
    return 0;
}